docs/notes/emacs/org_babel.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Org Babel</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/static/main.css" />
</head>
<body>
<div id="preamble" class="status">
<nav id="navbar" class="cf">
  <ul class="cf">
    <li class="fl">
      <a href="/">cfclrk</a>
    </li>
    <li class="fr">
      <a href="/articles/home.html">Articles</a>
    </li>
    <li class="fr">
      <a href="/notes/home.html">Notes</a>
    </li>
	<li class="fr">
      <a href="/cloudformation/home.html">CloudFormation</a>
    </li>
  </ul>
</nav>
</div>
<div id="content" class="content">
<header>
<h1 class="title">Org Babel</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgd120857">Print Error of Code Block</a>
<ul>
<li><a href="#org9645a3d">Shell</a>
<ul>
<li><a href="#org19de802">NOT WORKING</a></li>
</ul>
</li>
<li><a href="#orge4222ec">Python</a></li>
</ul>
</li>
<li><a href="#org8c040c5">Emacs Lisp</a></li>
<li><a href="#orgb266eaf">TRAMP</a>
<ul>
<li><a href="#orgde272a4">Single Hop</a></li>
<li><a href="#org330dd83">Double-Hop (Use a Bastion)</a></li>
</ul>
</li>
<li><a href="#org7e30a01">Copy File to Remote Machine</a></li>
<li><a href="#orgcd64358">IP Address Variable</a></li>
</ul>
</div>
</nav>

<div id="outline-container-orgd120857" class="outline-2">
<h2 id="orgd120857"><a href="#orgd120857">Print Error of Code Block</a></h2>
<div class="outline-text-2" id="text-orgd120857">
<p>
Relevant SO questions:
</p>

<ul class="org-ul">
<li><a href="https://emacs.stackexchange.com/questions/60649/show-compilation-errors-in-results-code-blocks">Show compilation errors in “#+RESULTS” code blocks</a></li>
<li><a href="https://emacs.stackexchange.com/questions/48835/help-me-avoid-true-in-org-babel-bash-statements/48842#48842">Help me avoid “|| true” in org babel bash statements</a></li>
</ul>
</div>

<div id="outline-container-org9645a3d" class="outline-3">
<h3 id="org9645a3d"><a href="#org9645a3d">Shell</a></h3>
<div class="outline-text-3" id="text-org9645a3d">
<div class="org-src-container">
<pre class="src src-bash">ls --foo
</pre>
</div>

<div class="results">#+RESULTS:</div><pre class="example">
ls: unrecognized option '--foo'
Try 'ls --help' for more information.
</pre>
</div>

<div id="outline-container-org19de802" class="outline-4">
<h4 id="org19de802"><a href="#org19de802">NOT WORKING</a></h4>
<div class="outline-text-4" id="text-org19de802">
<p>
Doesn't work:
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #c678dd;">echo</span> <span style="color: #98be65;">"hi"</span>
<span style="color: #51afef;">exit</span> 1
</pre>
</div>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #c678dd;">set</span> -u
<span style="color: #c678dd;">echo</span> $<span style="color: #dcaeea;">foo</span>
<span style="color: #c678dd;">echo</span> <span style="color: #98be65;">"hi"</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sh">ssh -T github-work
</pre>
</div>

<p>
Instead, this works though:
</p>

<div class="org-src-container">
<pre class="src src-sh">ssh -T github-work 2&gt;&amp;1 || true
</pre>
</div>

<div class="results">#+RESULTS:</div><pre class="example">
Hi chrisc-ironnet! You've successfully authenticated, but GitHub does not provide shell access.
</pre>
</div>
</div>
</div>

<div id="outline-container-orge4222ec" class="outline-3">
<h3 id="orge4222ec"><a href="#orge4222ec">Python</a></h3>
<div class="outline-text-3" id="text-orge4222ec">
<div class="org-src-container">
<pre class="src src-sh">python -c <span style="color: #98be65;">'bar=b"&#1054;&#1060;&#1048;&#1057;"''</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org8c040c5" class="outline-2">
<h2 id="org8c040c5"><a href="#org8c040c5">Emacs Lisp</a></h2>
<div class="outline-text-2" id="text-org8c040c5">
<p>
To print data structure, use <code>:results value pp</code>
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgbc733d2">'<span style="color: #51afef;">(</span><span style="color: #c678dd;">(</span><span style="color: #98be65;">"DeploymentName"</span> <span style="color: #98be65;">"webserver"</span><span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">(</span><span style="color: #98be65;">"KeyName"</span> <span style="color: #98be65;">"cfc"</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">Params
</pre>
</div>

<div class="results">#+RESULTS:</div><pre class="example">
(("DeploymentName" "webserver")
 ("KeyName" "cfc"))
</pre>
</div>
</div>

<div id="outline-container-orgb266eaf" class="outline-2">
<h2 id="orgb266eaf"><a href="#orgb266eaf">TRAMP</a></h2>
<div class="outline-text-2" id="text-orgb266eaf">
</div>
<div id="outline-container-orgde272a4" class="outline-3">
<h3 id="orgde272a4"><a href="#orgde272a4">Single Hop</a></h3>
<div class="outline-text-3" id="text-orgde272a4">
<pre class="example" id="org4ef8b8b">
:dir /ssh:ec2-user@1.2.3.4:/
</pre>
</div>
</div>

<div id="outline-container-org330dd83" class="outline-3">
<h3 id="org330dd83"><a href="#org330dd83">Double-Hop (Use a Bastion)</a></h3>
<div class="outline-text-3" id="text-org330dd83">
<pre class="example" id="org91bf35c">
:dir /ssh:ec2-user@1.2.3.4|ssh:ec2-user@10.192.1.2:/
</pre>
</div>
</div>
</div>

<div id="outline-container-org7e30a01" class="outline-2">
<h2 id="org7e30a01"><a href="#org7e30a01">Copy File to Remote Machine</a></h2>
<div class="outline-text-2" id="text-org7e30a01">
<p>
This leverages my <code>host</code> function.
</p>

<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #51afef;">(</span>copy-file MyFile <span style="color: #c678dd;">(</span>host <span style="color: #98be65;">"ec2-user"</span> <span style="color: #98be65;">"/tmp/my_file.txt"</span> 'sudo<span style="color: #c678dd;">)</span> t<span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgcd64358" class="outline-2">
<h2 id="orgcd64358"><a href="#orgcd64358">IP Address Variable</a></h2>
<div class="outline-text-2" id="text-orgcd64358">
<p>
Because you don't want to hard-code IP addresses in your source blocks like
some kind of animal!
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">defun</span> <span style="color: #c678dd;">host</span> <span style="color: #c678dd;">(</span>user ip path <span style="color: #ECBE7B;">&amp;optional</span> sudo<span style="color: #c678dd;">)</span>
  <span style="color: #83898d;">"Return a TRAMP string for SSHing to a remote host.</span>
<span style="color: #83898d;">USER is a user name on the remote host IP. PATH is the path on</span>
<span style="color: #83898d;">the remote host at which to execute the source block. If SUDO is</span>
<span style="color: #83898d;">non-nil, use sudo on the remote host."</span>
  <span style="color: #c678dd;">(</span><span style="color: #51afef;">if</span> sudo
      <span style="color: #98be65;">(</span><span style="color: #51afef;">s-lex-format</span> <span style="color: #98be65;">"/ssh:${user}@${ip}|sudo:${ip}:${path}"</span><span style="color: #98be65;">)</span>
    <span style="color: #98be65;">(</span><span style="color: #51afef;">s-lex-format</span> <span style="color: #98be65;">"/ssh:${user}@${ip}:${path}"</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>

<p>
Then set variables at the top of a file, and use something like:
</p>

<pre class="example" id="org15bb9eb">
#+begin_src bash :dir (host (getenv "HOST") (getenv "USER") "/home/ec2-user")
  pwd
#+end_src
</pre>
</div>
</div>
</div>
</body>
</html>
